{"t1": "Picard fails to stop Soran as he succeeds in launching another probe into the Veridian system's star, resulting in a similar shockwave to the one that destroyed the observatory. The shockwave alters the course of the ribbon, causing the destruction of Veridian III, the Enterprise, and its crew. Soran and Picard enter the Nexus, and Picard finds himself surrounded by an idealized family, but discovers it is an illusion. He is confronted by an \"echo\" of Guinan left behind in the Nexus. Guinan sends him to meet Kirk, safe in the Nexus. Though Kirk is initially entranced by the opportunity to atone for past regrets, he realizes it lacks danger and excitement. Having learned that they can travel whenever and wherever desired through the Nexus, Picard convinces Kirk to return with him to Veridian III, shortly before Soran launches the probe.  Working together, Kirk and Picard distract Soran long enough for Picard to lock the probe in place; it explodes on the launchpad and kills Soran. Kirk is fatally injured in the effort, and, after he dies, Picard buries him on the mountain. Three Federation starships arrive to retrieve Enterprise's survivors from Veridian III. Picard muses that given the ship's legacy, Enterprise will not be the last vessel to carry the name.", "t2": "Star Trek Generations is a 1994 American science fiction film and the seventh film in the Star Trek film series. Malcolm McDowell joins cast members from the 1960s television show Star Trek and the 1987 spin-off The Next Generation, including William Shatner and Patrick Stewart. In the film, Captain Jean-Luc Picard of the USS Enterprise-D joins forces with Captain James T. Kirk to stop the villain Tolian Soran from destroying a planetary system in his attempt to return to an extra-dimensional realm known as the Nexus.  Generations was conceived as a handoff from the original cast of the Star Trek films to the cast of The Next Generation. After developing several film ideas concurrently, the producers chose a script written by Ronald D. Moore and Brannon Braga. Production began while the final season of the television series was being made. The director was David Carson, who previously directed episodes of the television series; photography was by franchise newcomer John A. Alonzo. Filming took place on the Paramount Studios lots, and on location in Valley of Fire State Park, Nevada, and Lone Pine, California. The film's climax was revised and reshot following poor reception from test audiences. The film uses a mix of traditional optical effects alongside computer-generated imagery, and was scored by regular Star Trek composer Dennis McCarthy. ", "t3": "Enterprise crewmember Guinan tells Picard that she and Soran were among the El-Aurians rescued in 2293. Soran is obsessed with reentering the energy ribbon to reach the \"Nexus\", an extra-dimensional realm that exists outside of normal space-time. Soran—who lost his family when his homeworld was destroyed—wants to escape death through the Nexus, which Guinan describes as \"pure joy\" and where time has no meaning. Picard and Data determine that Soran, unable to fly a ship directly into the ribbon, is altering its path by removing the gravitational effects of nearby stars. He plans to destroy another star to bring the ribbon to him on the planet Veridian III, consequently killing millions on a nearby inhabited planet.  Upon entering the Veridian system, Picard offers himself to the Duras sisters in exchange for La Forge, but insists that he be transported to Soran directly. La Forge is returned to Enterprise, but unwittingly exposes the ship's defense details through the transmitter installed in his device. The ship of the Duras sisters attacks, and Enterprise sustains critical damage before destroying the Bird of Prey by using photon torpedoes. When La Forge reports that Enterprise is about to suffer a warp core breach as a result of the attack, Commander William Riker evacuates everyone to the forward saucer section of the starship, which separates from the engineering section just before the breach occurs. The resulting shockwave sends the saucer section crashing onto the surface of Veridian III, damaging it beyond repair. ", "t4": "Star trek cool man, yo"}